In [2]:
from platform import python_version
print(python_version())

3.8.12

In [3]:
# CONTOH FUNGSI ESSENSIAL PANDAS : 
# reindexing, Drop Entry, Indexing; selection and Filtering; Indeks integer; Arithmathics dan Penyelarasan Data; Mapping, sorting dan--config-dir

In [4]:
# Reindexing
import pandas as pd

obj = pd.Series([1,2,3,4,5], index = [10,20,30,40,50])
obj

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [5]:
obj2 = obj.reindex([100,200,300,400,500])
obj2

100   NaN
200   NaN
300   NaN
400   NaN
500   NaN
dtype: float64

In [6]:
obj3 = pd.Series(["Blue","Purple","Yellow"], index = [5,8,10])
obj3.reindex(range(12), method = "ffill")

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
5       Blue
6       Blue
7       Blue
8     Purple
9     Purple
10    Yellow
11    Yellow
dtype: object

In [7]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=["a","c","d"],columns=["Ohio","Utah","California"])
frame

   Ohio  Utah  California
a     0     1           2
c     3     4           5
d     6     7           8

In [8]:
frame.reindex(["a","b","c","d"])

   Ohio  Utah  California
a   0.0   1.0         2.0
b   NaN   NaN         NaN
c   3.0   4.0         5.0
d   6.0   7.0         8.0

In [9]:
states = ["Jawa Timur","Jawa Tengah","Jawa Barat"]
frame.reindex(columns=states)

   Jawa Timur  Jawa Tengah  Jawa Barat
a         NaN          NaN         NaN
c         NaN          NaN         NaN
d         NaN          NaN         NaN

In [10]:
# mengahpus menggunakan drop

In [11]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ["Ohio","Colorado","Utah","New York"],
                   columns=["One","Two","Three","Four"])
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.drop(["Ohio"]) #Menghapus Baris
data.drop("One",axis = 1) #Menghapus Kolom

          Two  Three  Four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [13]:
obj = pd.Series(np.arange(4),index=["a","b","c","d"]) #slicing
print(obj)
obj[obj<2]

a    0
b    1
c    2
d    3
dtype: int32

a    0
b    1
dtype: int32

In [14]:
print(obj)
obj["a":"c"]

a    0
b    1
c    2
d    3
dtype: int32

a    0
b    1
c    2
dtype: int32

In [15]:
obj["b"] = 5
obj

a    0
b    5
c    2
d    3
dtype: int32

In [43]:
data2 = pd.DataFrame(np.arange(16).reshape((4,4)),index = ["Ohio","Colorado","Utah","New York"],
                   columns=["One","Two","Three","Four"])
data2

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data2.loc["Colorado",["Two","Three"]] #Mengambil sebuah nilai berdasarkan baris dan kolomnya

Two      5
Three    6
Name: Colorado, dtype: int32

In [55]:
data2.iloc[[1,2,3],[0,2,3]]

          One  Three  Four
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [61]:
data2.iloc[:3,:] #SLICING AMBIL SELURUH KOLOM

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [67]:
data2.iloc[:,:3] # SLICING AMBIL SELURUH BARIS

          One  Two  Three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [69]:
data2.iloc[:,:][data2.Three >10]

          One  Two  Three  Four
New York   12   13     14    15

In [77]:
print(data2)
data2.iloc[-1]

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

One      12
Two      13
Three    14
Four     15
Name: New York, dtype: int32

In [83]:
Rendika = pd.Series([1,2,3,4,5], index = [10,20,30,40,50])
Suzy = pd.Series([6,7,8,9,10], index =[10,20,30,60,70])
Rendika + Suzy

#ditambahkan jika index nya sama, dan digabunagkan saja dibawahnya jika index kedua nya berbeda

10     7.0
20     9.0
30    11.0
40     NaN
50     NaN
60     NaN
70     NaN
dtype: float64